app/views/questions/index.html.erb

        <td><%= question.description %></td>
        <td style="white-space: nowrap;"><%= question.user.first_name %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]