app/views/questions/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "votes" WHERE "votes"."question_id" = $1  [["question_id", 1]]
---
<p><%=@question.description%></p><br><br/>
<p>posted by <%=User.find(@question.user_id).first_name%> <%=User.find(@question.user_id).last_name%> at <%=@question.created_at%><br/>

<%= link_to "UPVOTE | #{Vote.where(question_id: @question.id).count}", vote_question_votes_path(@question), class: "btn btn-default btn-sm" %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
			<div class="card-header">
			  <%= a.user.first_name %> Answered <%= a.created_at %>