app/controllers/home_controller.rb

  def home
  	@questions = Question.all
---
SELECT "questions".* FROM "questions"