app/controllers/questions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    if params[:tag]
      @questions = Question.tagged_with(params[:tag])
    elsif params[:action] == "dashboard"
      @user = User.find(params[:id])