app/controllers/questions_controller.rb

  def index
    if params[:tag]
      @questions = Question.tagged_with(params[:tag])
    else
      @questions = Question.all
---
SELECT "questions".* FROM "questions"

  def show
    @answers = Answer.where(question_id: @question.id)
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]