app/controllers/users_controller.rb

  def create
    @user = user_from_params

    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "remember_token", "first_name", "last_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"