app/controllers/votes_controller.rb

INSERT INTO "votes" ("user_id", "answer_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 3], ["answer_id", 1]]
INSERT INTO "votes" ("user_id", "question_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 3], ["question_id", 1]]
UPDATE "votes" SET "vote" = $1 WHERE "votes"."id" = $2  [["vote", true], ["id", 3]]
---
  def vote
  	byebug
  	if @vote.nil?
  		if params[:question_id].nil?
  		 Vote.create(answer_id: params[:answer_id], user_id: current_user.id)
  		 redirect_to question_path(@vote.answer.question.id)
  		elsif params[:answer_id].nil?
  		 Vote.create(question_id: params[:question_id], user_id: current_user.id)
  		 redirect_to question_path(@vote.question_id)
  		end
    else
    	@question = @vote.question || @vote.answer.question
	    if @vote.vote.nil?
	      @vote.update(vote: true)

SELECT  "votes".* FROM "votes" WHERE "votes"."question_id" = $1 AND "votes"."user_id" = $2 LIMIT $3  [["question_id", 1], ["user_id", 3], ["LIMIT", 1]]
---
  def set_vote
  	@vote = Vote.find_by(answer_id: params[:answer_id], user_id: current_user.id) || Vote.find_by(question_id: params[:question_id], user_id: current_user.id)